import { createRoot } from "react-dom/client";
import type { ReactNode } from "react";
import { Fragment } from "react";
import { Button } from "../components/Button";

interface RepoInfo {
  creator: string;
  repo: string;
  topics: string[];
}

// 获取仓库信息
const getRepoInfo = async () => {
  const { location } = window;
  const { pathname } = location;
  const [_, creator, repo] = pathname.split("/") || [];

  // 通过接口，对仓库信息进行校验
  if (creator && repo) {
    try {
      const res = await fetch(
        `https://api.github.com/repos/${creator}/${repo}`,
        {
          method: "GET",
          headers: {
            Accept: "application/vnd.github+json",
            "X-GitHub-Api-Version": "2022-11-28",
          },
        }
      );
      const data = await res.json();

      console.log("repo service info>>", data);

      if (data?.status === "404") return null;
      return { creator, repo, topics: data?.topics || [] } as RepoInfo;
    } catch {
      return null;
    }
  }
  return null;
};

// 获取 DeepWiki 链接
const getDeepWikiUrl = (info: RepoInfo) => {
  return `https://deepwiki.com/${info.creator}/${info.repo}`;
};

// 获取 VsCode Online 链接
const getVsCodeOnlineUrl = (info: RepoInfo) => {
  return `https://github.dev/${info.creator}/${info.repo}`;
};

// 获取stackblitz链接
const getStackblitzUrl = (info: RepoInfo) => {
  return `https://stackblitz.com/github/${info.creator}/${info.repo}`;
};

// 获取Search链接
const getSearchUrl = (topics: string[]) => {
  const query = topics.map((topic) => (topic += " in:topics"));
  const queryString = query.join(" OR ");
  return `https://github.com/search?q=${queryString}&type=repositories`;
};

// 渲染
const render = (element: ReactNode) => {
  const root = document.querySelector(".AppHeader");
  const container = document.createElement("div");
  container.style = "padding: 12px 8px";
  container.id = "github-helper";
  if (root) {
    root.appendChild(container);
    createRoot(container).render(element);
  }
};

// 获取仓库信息
getRepoInfo().then((repoInfo) => {
  if (repoInfo) {
    const deepwikiUrl = getDeepWikiUrl(repoInfo);
    const vscodeOnlineUrl = getVsCodeOnlineUrl(repoInfo);
    const stackblitzUrl = getStackblitzUrl(repoInfo);
    const searchUrl = getSearchUrl(repoInfo.topics);

    const CopilotButton = () => {
      const handleCopilotButtonClick = () => {
        const menuBtn = document.querySelector("#global-copilot-menu-button");
        if (menuBtn) {
          menuBtn.click();
          setTimeout(() => {
            const listItem = document.querySelector(
              'ul[aria-label="New conversation in"][role="group"] > li'
            );
            if (listItem) {
              listItem.click();
            }
          }, 100);
        }
      };
      return (
        <Button
          text="Copilot"
          onClick={handleCopilotButtonClick}
          iconSVG={
            <svg
              t="1750931656408"
              className="octicon octicon-graph UnderlineNav-octicon d-none d-sm-inline"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="5101"
              width="16"
              height="16"
            >
              <path
                d="M413.4 568.8c-11.9 0-21.9 4-29.9 11.9-8 8-11.9 17.9-11.9 29.9v83.6c0 11.9 4 21.9 11.9 29.9 8 8 17.9 11.9 29.9 11.9s21.9-4 29.9-11.9c8-8 11.9-17.9 11.9-29.9v-83.6c0-11.9-4-21.9-11.9-29.9-8-8-17.9-11.9-29.9-11.9z m239 125.4c0 11.9-4 21.9-11.9 29.9-8 8-17.9 11.9-29.9 11.9s-21.9-4-29.9-11.9c-8-8-11.9-17.9-11.9-29.9v-83.6c0-11.9 4-21.9 11.9-29.9 8-8 17.9-11.9 29.9-11.9s21.9 4 29.9 11.9c8 8 11.9 17.9 11.9 29.9v83.6zM503 165.6c-33.8-37.8-88.6-51.8-164.3-41.8-69.7 6-120.5 28.9-152.3 68.7-25.9 33.8-38.8 80.6-38.8 140.4s5 68.7 14.9 92.6l-9 44.8-3 3c-27.9 11.9-49.3 30.4-64.2 55.3s-22.4 52.3-22.4 82.1v68.7c0 11.9 3 22.9 9 32.9 4 6 9.5 13.4 16.4 22.4 7 9 17.4 19.4 31.4 31.4l32.9 23.9c11.9 10 24.9 18.9 38.8 26.9 23.9 11.9 48.8 23.9 74.7 35.8 81.6 33.8 163.3 50.8 244.9 50.8s163.3-16.9 244.9-50.8c25.9-11.9 50.8-23.9 74.7-35.8 13.9-8 26.9-16.9 38.8-26.9l32.9-23.9c13.9-11.9 24.4-22.4 31.4-31.4s12.4-16.4 16.4-22.4c6-10 9-20.9 9-32.9v-68.7c0-29.9-7.5-57.2-22.4-82.1-14.9-24.9-36.3-43.3-64.2-55.3l-3-3-9-44.8c10-23.9 14.9-54.8 14.9-92.6 0-59.7-12.9-106.5-38.8-140.4-31.9-39.8-82.6-62.7-152.3-68.7-75.7-10-130.4 4-164.3 41.8l-9 9c-2-4-5-7-9-9zM234.2 497.1c23.9 10 55.8 14.9 95.6 14.9 65.7 0 116.5-17.9 152.3-53.8s21.9-25.9 29.9-41.8c8 15.9 17.9 29.9 29.9 41.8C577.7 494 628.5 512 694.2 512s71.7-5 95.6-14.9l3 6V742h-3c-19.9 11.9-41.8 22.9-65.7 32.9-71.7 29.9-142.4 44.8-212.1 44.8s-140.4-14.9-212.1-44.8c-23.9-10-45.8-20.9-65.7-32.9h-3V503.1l3-6z m209.1-274.7c13.9 15.9 17.9 45.8 11.9 89.6-4 39.8-15.4 69.2-34.3 88.1-18.9 18.9-49.3 28.4-91.1 28.4s-68.7-6.5-80.6-19.4c-11.9-12.9-17.9-39.3-17.9-79.1s7.5-69.2 22.4-88.1c14.9-18.9 46.3-30.9 94.1-35.8 47.8-5 79.6 0.5 95.6 16.4z m137.4 0c15.9-15.9 47.8-21.4 95.6-16.4s79.1 16.9 94.1 35.8c14.9 18.9 22.4 48.3 22.4 88.1s-6 66.2-17.9 79.1c-11.9 12.9-38.8 19.4-80.6 19.4s-72.2-9.5-91.1-28.4c-18.9-18.9-30.4-48.3-34.3-88.1-6-43.8-2-73.7 11.9-89.6z"
                p-id="5102"
              ></path>
            </svg>
          }
        />
      );
    };

    const DeepwikiButton = () => (
      <Button
        url={deepwikiUrl}
        text="Deep Wiki"
        iconSVG={
          <svg
            t="1750924686956"
            className="octicon octicon-graph UnderlineNav-octicon d-none d-sm-inline"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="25946"
            width="16"
            height="16"
          >
            <path
              d="M954.9 424.3c-3.1-3.8-3.9-6.8-2.5-11.3 11.5-37.1 14.7-74.7 8.4-113.2-9.3-64.3-43-122.5-94.1-162.6C806.2 89 736.9 71.8 660.5 84.5c-7.2 1.2-11.5-0.8-16.6-5.8-65.1-65.5-144.3-90.8-234.2-73.3-95.4 18.4-160.8 75.8-195.3 167.2-1.6 4.2-3.4 6.5-8.5 7.7-59 14.2-108 44.5-144.8 92.8-46.9 61.8-64 131.2-49.7 207.8 8.4 44.3 27.5 83.5 56.8 117.6 4 4.7 4.7 8.7 2.9 14.3-7.9 23.5-10.4 47.9-11 73 0.7 18.2 1.9 36.9 6.2 55.1 30.7 136 163.4 223.5 300.5 198 5.5-0.9 8.1 0.3 11.5 3.9 65.4 67.2 145.3 93.5 236.6 75.7 95.5-18.5 160.3-76.6 195.1-167.7 1.6-4.1 3.4-6 7.9-7.1 108.8-25.1 189-117.5 198.4-228.7 6.6-71.5-14.4-135.6-61.4-190.7m-62.3-126.2c4.4 21.6 5.8 43.2 3.1 65.1-0.3 2.5-1.1 4.9-1.8 8.3l-56-32.3c-49.1-28.4-98.4-56.5-147.3-85.4-14.1-9.5-32.6-9.4-46.7 0.1-74.8 43.8-150 86.8-225 130.1-2.4 1.3-4.4 3.5-8.2 3.2v-96.9c0-3.6 2.3-4.7 4.7-6.2 66.8-38.5 133-78.2 200.5-115.2 110-60.2 251.6 6.6 276.7 129.2M613 511.1c0 17.7-0.1 35.3 0.1 52.9 0 4.1-1.1 6.5-4.9 8.6-30.7 17.5-61.2 35.2-91.6 53.1-3.4 1.9-5.8 2.1-9.3 0.1-30.4-17.8-61-35.5-91.6-53-4-2.3-5.2-4.9-5.2-9.4 0.2-34.4 0.2-68.7 0-103.1 0-4.8 1.4-7.5 5.7-10 29.9-17.1 59.7-34.3 89.4-51.7 4.4-2.5 7.6-2.9 12.3-0.2 29.7 17.5 59.4 34.7 89.3 51.8 4.2 2.4 5.9 5 5.9 9.9-0.3 16.9-0.1 34-0.1 51M265.8 263.3c0.1-96.7 61.8-174.4 156.5-193.4 58.2-11.5 111.4 3.4 159.5 41.2l-78 44.8c-43.2 24.9-86.4 50-129.8 74.7-12.9 6.7-20.7 20.3-19.8 34.8v270.8c-3 0.8-4.7-1.4-6.7-2.5-25-14.3-49.9-29-75-43-5.2-2.9-6.7-6.3-6.7-12 0.1-71.8 0-143.6 0-215.4M74.5 450.6c-9.4-83.4 42.1-168.2 120.4-197.5 1.3-0.4 2.6-0.7 4.4-1.1v59.1c0 59 0.2 118 0 177-0.2 17.3 6.7 29.2 21.9 37.9 75.7 43.1 151.2 86.9 226.6 130.4l7.3 4.4-83.8 48.5c-2.9 1.7-5.1 2.4-8.4 0.4-67.7-39.3-136.3-76.8-202.7-117.9-51.5-31.8-79-80.7-85.7-141.2M159.1 791c-26.8-40.8-37-90.3-28.6-138.4l13.3 7.3C208 697 272.3 734.1 336.5 771.4c12.6 8.2 28.8 8.2 41.4 0 76.5-44.3 153.1-88.5 229.6-132.6l5.7-3.2c0 33.3 0 65.3 0.2 97.3 0 3.9-1.9 5.5-4.7 7.1-66.1 37.9-131.5 77-198.4 113.6C323 901 214 873.8 159.1 791m598.4-13.8c-1.9 69.1-46.3 137.3-121.6 167.2-65.3 25.1-139 12.8-192.6-32l90.8-52.3c38.6-22.3 77.1-44.8 115.9-66.7 13-6.5 20.8-20.1 19.8-34.5-0.3-87.6-0.1-175.2-0.1-263 0-9.6 0-9.6 8.1-5.1 24.9 14.4 49.8 28.9 74.8 43.1 4 2.3 5.6 4.6 5.5 9.3-0.1 77.9 1.5 156-0.6 234m77-8.8c-9.9 4.3-9.9 4.3-9.9-6.4 0-76.1-0.3-152.2 0.2-228.2 1-15-7.1-29.1-20.6-35.8-74.7-42.8-149.2-86-223.8-129l-11.4-6.7 84.8-48.9c3-1.8 5.1-0.8 7.7 0.6 67 38.8 134.7 76.2 200.7 116.3 50.4 30.8 78.9 77.5 86.8 136.2 11.7 85.3-35.2 168.1-114.5 201.9"
              p-id="25947"
              fill="#59636e"
            ></path>
          </svg>
        }
      />
    );

    const VscodeOnlineButton = () => (
      <Button
        text="VsCode Online"
        url={vscodeOnlineUrl}
        iconSVG={
          <svg
            t="1750929904924"
            className="octicon octicon-graph UnderlineNav-octicon d-none d-sm-inline"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="10548"
            width="16"
            height="16"
          >
            <path
              d="M719.7 957.4c-15 0.1-29.3-5.8-39.9-16.4L326.9 619l-77.5 58.8-76.3 57.8a37 37 0 0 1-24.2 7.6c-8.7-0.4-17-3.8-23.4-9.7l-49.3-44.8C61 674.8 59.9 651.2 73.7 636c0.8-0.9 1.6-1.7 2.5-2.5l133.3-121.6-62.4-57.1-70.8-64.6c-15.2-13.9-16.3-37.4-2.5-52.7 0.8-0.9 1.6-1.7 2.5-2.5l49.3-44.8c13.3-12.1 33.4-13.1 47.7-2.2L327 404.7 679.8 82.9A55.69 55.69 0 0 1 721 66.6c7.9 0.2 15.7 2 22.8 5.5l184.5 88.7c19.4 9.3 31.7 29 31.7 50.5v2.2-1 599-1 2.1c0 21.5-12.3 41.2-31.7 50.6l-184.5 88.7c-7.5 3.6-15.8 5.5-24.1 5.5z m16-648.4L468.1 512l267.7 203.1v-406z"
              fill="#666666"
              p-id="10549"
            ></path>
          </svg>
        }
      ></Button>
    );

    const StackBlitz = () => (
      <Button
        url={stackblitzUrl}
        text="stackblitz"
        iconSVG={
          <svg
            t="1750929804621"
            className="octicon octicon-graph UnderlineNav-octicon d-none d-sm-inline"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="6852"
            width="16"
            height="16"
          >
            <path
              d="M466.176 595.126857h-272.822857L692.114286 54.857143l-134.253715 374.016h272.822858L331.885714 969.142857l134.253715-374.016z"
              p-id="6853"
            ></path>
          </svg>
        }
      ></Button>
    );

    const SearchButton = () => (
      <Button
        text="Similar Search"
        url={searchUrl}
        iconSVG={
          <svg
            t="1750991875927"
            className="octicon octicon-graph UnderlineNav-octicon d-none d-sm-inline"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="10407"
            width="16"
            height="16"
          >
            <path
              d="M96 448c17.066667 0 32-14.933333 32-32V170.666667c0-23.466667 19.2-42.666667 42.666667-42.666667h245.333333c17.066667 0 32-14.933333 32-32S433.066667 64 416 64H149.333333C102.4 64 64 102.4 64 149.333333v266.666667c0 17.066667 14.933333 32 32 32zM608 128H853.333333c23.466667 0 42.666667 19.2 42.666667 42.666667v245.333333c0 17.066667 14.933333 32 32 32s32-14.933333 32-32V149.333333c0-46.933333-38.4-85.333333-85.333333-85.333333H608c-17.066667 0-32 14.933333-32 32S590.933333 128 608 128zM416 896H170.666667c-23.466667 0-42.666667-19.2-42.666667-42.666667V608c0-17.066667-14.933333-32-32-32S64 590.933333 64 608V874.666667c0 46.933333 38.4 85.333333 85.333333 85.333333h266.666667c17.066667 0 32-14.933333 32-32s-14.933333-32-32-32zM928 576c-17.066667 0-32 14.933333-32 32V853.333333c0 23.466667-19.2 42.666667-42.666667 42.666667H608c-17.066667 0-32 14.933333-32 32s14.933333 32 32 32H874.666667c46.933333 0 85.333333-38.4 85.333333-85.333333V608c0-17.066667-14.933333-32-32-32z"
              fill="#666666"
              p-id="10408"
            ></path>
            <path
              d="M714.666667 736c12.8 12.8 32 12.8 44.8 0s12.8-32 0-44.8l-81.066667-81.066667c68.266667-91.733333 61.866667-221.866667-21.333333-305.066666-91.733333-91.733333-241.066667-91.733333-332.8 0-91.733333 91.733333-91.733333 241.066667 0 332.8 85.333333 85.333333 217.6 91.733333 309.333333 19.2l81.066667 78.933333z m-345.6-145.066667c-66.133333-66.133333-66.133333-174.933333 0-241.066666s174.933333-66.133333 241.066666 0 66.133333 174.933333 0 241.066666-172.8 66.133333-241.066666 0z"
              fill="#666666"
              p-id="10409"
            ></path>
          </svg>
        }
      ></Button>
    );

    const element = (
      <Fragment>
        <CopilotButton />
        <DeepwikiButton />
        <VscodeOnlineButton />
        <StackBlitz />
        {repoInfo.topics && repoInfo.topics.length > 0 && <SearchButton />}
      </Fragment>
    );
    render(element);
  }
});
